{"title":"How I Maintain Inbox Zero","slug":"inbox-zero","md":"<p>I used to spend hours every morning working through my work emails. For a while I didn’t even question it. I mean, I’m getting paid, right?</p>\n<p>Then I read <em>The Power of Less</em> by Leo Babauta and I felt that everything was wrong with spending hours on email. If you step back and think about it, minimalist or no, who wants to spend any more of their life than necessary in an <em>email inbox</em>?</p>\n<p>It’s been many years since I changed my attitude toward email and I presently have a system that makes processing email fairly painless for me.</p>\n<p>For every email there are three options:</p>\n<ol>\n<li>archive it if it doesn’t merit a response via keyboard shortcut</li>\n<li>immediately respond if a template or yes/no response is sufficient</li>\n<li>stick it in my todo list via the Todoist <a href=\"https://chrome.google.com/webstore/detail/todoist-to-do-list-and-ta/jldhpllghnbhlbpcmnajkpdmadaolakh?hl=en\">Chrome extension</a></li>\n</ol>\n<p>This is basically just triage applied to email. But it lets me get to ‘real work’ so much faster, and I love that.</p>\n<h2 id=\"nutsandbolts\">Nuts and Bolts</h2>\n<p>The extension allows me to add tasks directly to projects in Todoist and schedule them with two clicks, or three clicks and a mouse drag if I’m adding a webpage as a task. I’d rather do everything via keyboard, but I’ve got a lot to keep track of, so I make concessions.</p>\n<p>Adding a webpage as a task is great if I want a reminder to read an article (I don’t have a great track record with bookmarks), or to revisit an issue on Github in a few days or weeks.</p>\n<h3 id=\"gmailsettings\">Gmail Settings</h3>\n<p>There’s some serious magic in these settings, but team’s criteria for categorizing an option as general or advanced escapes me. I’ve turned on <strong>Keyboard shortcuts</strong> in the general settings, so ‘e’ archives any email I’m reading.</p>\n<p>I use Conversation View, which groups emails of the same topic together.</p>\n<p>I’ve also turned on <strong>Auto-advance</strong> in the advanced settings, which will load up the next email after I delete, archive or mute a conversation. You can choose whether Auto-advance takes you forward or back (chronologically) through your email. For some silly reason, this setting is back on the general tab of the settings.</p>\n<p>Finally, I have turned on <strong>Canned Responses</strong> which allows you to create templates for repetitive communication. Fortunately, I don’t really need this.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>I still get sidetracked while processing email sometimes. I also wish dealing with email could be more automatic. The important part for now is that I’m really satisfied with what I’ve achieved so far.</p>\n<h3 id=\"notes\">Notes:</h3>\n<p>I used to use the Todoist for Gmail Chrome extension but didn’t enjoy it. It saves and then opens a link to an email in Gmail. Reloading the whole Gmail app whenever I view a todo ain’t my style.</p>"}