{"title":"10x Your Ability to Change: Read Switch by Chip and Dan Heath","slug":"read-switch","md":"<p>I <a rel=\"prefetch\" href=\"/blog/four-self-coaching-questions\">recently wrote</a> that Switch by Chip and Dave Heath taught me that I could change myself. This powerful experience made it one of my favorite books.</p>\n<p>Following the advice in Switch is simple once you’re familiar with its jargon. What you’ll learn is organized into three broad categories:</p>\n<ol>\n<li><strong>Rider</strong>: the analytical, focused part of our mental process</li>\n<li><strong>Elephant</strong>: the emotional, volatile part of our mental process</li>\n<li><strong>Path</strong>: the context or environment where change will be made</li>\n</ol>\n<p><object width=\"800\" height=\"1100\" type=\"application/pdf\" data=\"https://www.heathbrothers.com/download/switch-framework.pdf\">\n        <p>Error loading PDF. View it <a href=\"https://drive.google.com/viewerng/viewer?url=https://www.heathbrothers.com/download/switch-framework.pdf\">here</a>.</p>\n</object></p>\n<p><em>This outline is freely accessible from the Heath brothers’ <a href=\"https://www.heathbrothers.com/\">website</a></em></p>\n<p>Each of the nine bolded concepts¹ in the outline could fill a book of its own.</p>\n<p>However, instead of pushing the reader to learn all the nuances of the supporting research, the level of detail in Switch is sufficient to get the Pareto-optimal 80% of potential benefit.</p>\n<p>The power of learning all of these concepts becomes apparent when you use them together. They strengthen and support each other very effectively².</p>\n<h2 id=\"tldr\">TLDR</h2>\n<p>If you choose to read one book on how to make change, make it Switch.</p>\n<h3 id=\"notes\">Notes:</h3>\n<ol>\n<li>When you look at the outline of Switch, <strong>BUILD HABITS</strong> is one of nine areas. I think habits in a vacuum aren’t as valuable as they might seem.</li>\n<li>Learning about the broader context of how to make change multiplied the output of my efforts by about 10. My gratitude goes to John Berardi and Precision Nutrition for including Switch in their recommended reading list.</p></li>\n</ol>"}